qwert-asgardian/PIC16f887-projects/3.7 SEGMENT DISPLAY/MOTOR_CONTROL_TIMER.X/Motor_control_timer.c

#pragma config FOSC = INTRC_NOCLKOUT// Oscillator Selection bits (INTOSCIO oscillator: I/O function on RA6/OSC2/CLKOUT pin, I/O function on RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = ON       // Power-up Timer Enable bit (PWRT enabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = ON        // Internal External Switchover bit (Internal/External Switchover mode is enabled)
#pragma config FCMEN = ON       // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is enabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

#include <xc.h>
    void delay(unsigned int a){
        while(a--);
    }
    
    void main(){
        TRISA = 0x07; //INPUT
        PORTA = 0x00;
        ANSEL = 0x00;
        TRISC = 0x0;
        PORTC = 0x3F;
        TRISE = 0x00;
        PORTE = 0x00;
        ANSELH = 0x00;
        unsigned char arr[10]={0x3F,0x06,0x5B,0x4F,0x66,0x6D,0x7D,0x07,0x7F,0x6F};
        int count=0, i=0;
        
        while(1){
            if(RA0 == 1){
                count++;
                if(count > 9){
                    count = 9;
                }
                 while(RA0==1);
            }
            PORTC = arr[count];
            
            if(RA1 == 1){
                count--;
                if(count < 0){
                    count = 0;
                }
                 while(RA1==1);
            }
            PORTC = arr[count];
            
            if(RA2 == 1){
                RE0 = 1;
                for(i = count ; i >=0; i--){
                    PORTC = arr[i];
                    delay(100000);    
                }
                RE0=0;
                count = 0;   
            }   
        }    
    }

